package com.example.vyatsuapp.utils;

public class dropdownLists {
    private static final String[] FullTimeBachelorFacs = { "Пединститут", "Институт биологии и биотехнологии", "Институт химии и экологии",
            "Факультет автоматики и вычислительной техники", "Факультет истории, политических наук и культурологии", "Факультет компьютерных и физико-математических наук",
            "Факультет лингвистики", "Факультет международного образования", "Факультет менеджмента и сервиса", "Факультет педагогики и психологии", "Факультет строительства и архитектуры",
            "Факультет технологий, инжиниринга и дизайна", "Факультет физической культуры и спорта", "Факультет филологии и медиакоммуникаций", "Факультет экономики и финансов", "Электротехнический факультет", "Юридический институт"};
    private static final String[] FullTimeSpecFacs = {"Факультет автоматики и вычислительной техники", "Факультет технологий, инжиниринга и дизайна", "Факультет экономики и финансов", "Юридический институт"};
    private static final String[] FullTimeMasterFacs = {"Пединститут", "Институт биологии и биотехнологии", "Институт химии и экологии",
            "Факультет автоматики и вычислительной техники", "Факультет истории, политических наук и культурологии", "Факультет компьютерных и физико-математических наук",
            "Факультет лингвистики", "Факультет международного образования", "Факультет менеджмента и сервиса", "Факультет педагогики и психологии", "Факультет строительства и архитектуры",
            "Факультет технологий, инжиниринга и дизайна", "Факультет филологии и медиакоммуникаций", "Факультет экономики и финансов", "Электротехнический факультет", "Юридический институт"};
    private static final String[] FullTimeGraduateFacs = {"Институт биологии и биотехнологии", "Институт химии и экологии", "Факультет автоматики и вычислительной техники", "Факультет истории, политических наук и культурологии",
            "Факультет компьютерных и физико-математических наук", "Факультет лингвистики", "Факультет менеджмента и сервиса", "Факультет педагогики и психологии", "Факультет строительства и архитектуры", "Факультет технологий, инжиниринга и дизайна",
            "Факультет физической культуры и спорта", "Факультет филологии и медиакоммуникаций", "Факультет экономики и финансов", "Электротехнический факультет", "Юридический институт"};
    private String selectedEducationType; //Бакалавриат, Специалитет, Магистратура, Аспирантура

    public dropdownLists(String selectedEducationType) {
        this.selectedEducationType = selectedEducationType;
    }

    public String[] spFacultyItems() {
        return switch (selectedEducationType) {
            case "Бакалавр" -> FullTimeBachelorFacs;
            case "Специалист" -> FullTimeSpecFacs;
            case "Магистр" -> FullTimeMasterFacs;
            default -> FullTimeGraduateFacs;
        };
    }
}
